app/Controllers/Tools.php

    public function jpgToPng_convert()
    {
        $bahan = $this->request->getFile('fileJpgToPng');
        $imageObject = imagecreatefromjpeg($bahan);

        $namaImg = $bahan->getRandomName();
        $conv = imagepng($imageObject, 'img/filettjpgtopng/' . $namaImg . '. png');

        $this->TTJpgToPngModel->save([
            'img_file' => $namaImg,
        ]);
---
INSERT INTO `TTJpgToPng` (`file_img`) VALUES ('img/filettjpgtopng/1668774791_42688a3577dd0cee2a83.png')